# Lesson 4: Data Analytics using Pandas

In [3]:
pip install pandas

Requirement already satisfied: pandas in /Users/avenue7media/opt/anaconda3/lib/python3.9/site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/avenue7media/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /Users/avenue7media/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in /Users/avenue7media/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in /Users/avenue7media/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import numpy as np

<b> <h3> Series

In [11]:
labels= ('a','b','c')
my_list=[10,20,30] 
arr=np.array([10,20,30])
d={'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [15]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

<h3> Using Index - Series

In [18]:
ser1=pd.Series([1,2,3,4],index=['PH','USA','JAPAN','GERMANY'])
ser1

PH         1
USA        2
JAPAN      3
GERMANY    4
dtype: int64

In [19]:
ser2=pd.Series([1,2,5,4],index=['PH','USA','JAPAN','GERMANY'])
ser2

PH         1
USA        2
JAPAN      5
GERMANY    4
dtype: int64

In [20]:
ser1['JAPAN']=5
ser1

PH         1
USA        2
JAPAN      5
GERMANY    4
dtype: int64

In [21]:
ser1["GERMANY"]

4

In [22]:
ser1["JAPAN"]

5

<H3> DATA FRAME

In [26]:
import numpy as np
import pandas as pd

In [27]:
from numpy.random import rand

In [28]:
np.random.randint(2,6,3)

array([4, 3, 4])

In [29]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.903319  1.543568  3.014676 -0.139170
B  0.482311  0.977939 -0.344431 -1.785068
C  0.530949  0.628364  2.283261  0.148912
D  0.536175  0.144883 -0.627879  1.151898
E  0.259370 -1.186527 -0.673861 -1.555119

In [30]:
df=pd.DataFrame(randn(5,4))
df

          0         1         2         3
0 -0.566604 -0.790608  0.230762  1.028012
1 -0.888242 -2.141687 -0.976076  1.414672
2 -1.562469 -0.676467 -1.617897 -1.818591
3  0.171447  0.377750  1.049934 -0.526008
4 -0.304556 -0.484535  0.053539 -2.024119

In [31]:
df.iloc[0:2]

          0         1         2         3
0 -0.566604 -0.790608  0.230762  1.028012
1 -0.888242 -2.141687 -0.976076  1.414672

<h3> Create a New Column

In [32]:
df['New_Column']=9
df

          0         1         2         3  New_Column
0 -0.566604 -0.790608  0.230762  1.028012           9
1 -0.888242 -2.141687 -0.976076  1.414672           9
2 -1.562469 -0.676467 -1.617897 -1.818591           9
3  0.171447  0.377750  1.049934 -0.526008           9
4 -0.304556 -0.484535  0.053539 -2.024119           9

In [33]:
df.drop('New_Column')
#cant drop process if it's still running

KeyError: "['New_Column'] not found in axis"

In [34]:
df

          0         1         2         3  New_Column
0 -0.566604 -0.790608  0.230762  1.028012           9
1 -0.888242 -2.141687 -0.976076  1.414672           9
2 -1.562469 -0.676467 -1.617897 -1.818591           9
3  0.171447  0.377750  1.049934 -0.526008           9
4 -0.304556 -0.484535  0.053539 -2.024119           9

In [35]:
df.drop('New_Column',axis=1)

          0         1         2         3
0 -0.566604 -0.790608  0.230762  1.028012
1 -0.888242 -2.141687 -0.976076  1.414672
2 -1.562469 -0.676467 -1.617897 -1.818591
3  0.171447  0.377750  1.049934 -0.526008
4 -0.304556 -0.484535  0.053539 -2.024119

In [ ]:
#For Windows

import os
path='C:\Demo'
os.chdir(path)

In [ ]:
#python working directory
pwd

In [ ]:
data=pd.read_csv('Sample.csv')
data.head()

In [37]:
#For Mac

data=pd.read_excel('DemoXLS.xlsx')
data.head()

,Employee No,Last Name,First Name,Middle I,Email Add,Salary
0,12345,Costales,Jefferson,A,jacostales@mymail.mapua.edu.ph,10000.0
1,24673,Dela Cruz,Juan,D,juan@gmail.com,20000.0
2,11111,Tan,Angel,S,angeltan@gmail.com,30000.0
3,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN

In [38]:
data=pd.read_csv('DemoCSV.csv')
data.head()

,Employee No,Last Name,First Name,Middle I,Email Add,Salary
0,12345,Costales,Jefferson,A,jacostales@mymail.mapua.edu.ph,10000.0
1,24673,Dela Cruz,Juan,D,juan@gmail.com,20000.0
2,11111,Tan,Angel,S,angeltan@gmail.com,30000.0
3,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
pd.read_excel('DemoXLS.xlsx',sheet_name='InfoSheet_New')

,Employee No,Last Name,First Name,Middle I,Email Add,Salary
0,12345,Costales,Jefferson,A,jacostales@mymail.mapua.edu.ph,10000
1,24673,Dela Cruz,Juan,D,juan@gmail.com,20000
2,11111,Tan,Angel,S,angeltan@gmail.com,30000
3,NaN,NaN,NaN,NaN,NaN,NaN
4,NEW,NEW,NEW,NEW,NEW,NEW
5,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN
13,SUM,NaN,NaN,NaN,NaN,60000